/*:

# 欢迎光临Swift的世界

*/

/*:

## 关于Swift

Swift是用来开发iOS，OS X和watchOS应用的一种新语言，它集C和Objective-C的优点于一身，但是没有对C向下兼容的限制。Swift采用了安全编程的模式，加入了现代语言的特征，使得编程更简单，更有弹性，更有乐趣。Swift纯净的出身，在成熟和广受欢迎的Cocoa和Cocoa Touch框架的支持下，让所有开发者有机会对软件开发过程的进行重新思考。

Swift已经悄悄的开发了多年。苹果公司通过改进已有的编译器，调试器和开发框架基础，为Swift打下了坚实的基础。我们通过自动引用计数（Automatic Reference Counting, ARC）简化了内存管理。建立在Foundation和Cocoa的坚实基础上的框架集，也进行了彻底的现代化和标准化。Objective-C本身也已经支持块（Blocks。*译者注：Blocks类似于其他语言里的匿名函数，闭包；请区别于普通的花括号包围的语句块*），集合字面量（Collection Literals）和模块化，使框架能采用现代的语言技术而无后顾之忧。感谢这些基础工作，使我们能为未来的苹果软件开发引入一种全新的语言。

Objective-C开发者会觉得Swift很熟悉。它有着Objective-C的命名参数的可读性和Objective-C的动态对象模型。同时它能无缝访问现有的Cocoa框架，并通过混编（mix-and-match，*译者注：*）与Objective-C代码进行交互。在此基础上，Swift引入了许多新特征，并统一了语言的例程（procedural）和面向对象的部分。

Swift对新开发者更加友好。它是第一个像脚本语言一样具备强大的表达能力和令人愉悦的工业级的系统编程语言。它支持Playground（*译者注：直译为操场，但是放在语境里并不特别恰当，所以这里保持英语原文。*），一种创新特征让开发者可以随意测试Swift代码并立刻看到执行结果，而无需进行繁琐地编译和运行应用的操作。

Swift兼具现代语言的理念的精华以及历史悠久的苹果开发文化。编译器对性能进行了优化，语言对开发进行了优化，并坚持不对任何一方面作出牺牲。它被设计成能够编写简单的如“hello, world”代码，到开发整个操作系统。所有这一切，让Swift成为一门值得开发者和苹果全心投入的语言。

Swift是编写iOS，OS X和watchOS应用的一个极好的语言，它将继续通过引入新特征和新能力向前演进。我们为Swift定下了野心勃勃的目标。我们非常期待能看到你们用它创造出来的一切。

*/

//: [第2章 Swift导览 >>](@next)
